fonecmid-diplom.Расширение/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ef272a24-132c-4ed8-baf9-b3add7d281d5">
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="966b37bf-8dcc-468e-b37b-61be6ae69a71">
    <name>ВКМ_Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="11e1ef2d-e86b-43a5-b01b-65da4ef88eb9">
    <name>ВКМ_Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99f558f1-a556-42d5-a52c-639e7979e567">
    <name>ВКМ_Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="154f981f-4469-4e0f-aaab-e113260fedd8">
    <name>ВКМ_Специалист</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57fd3b55-02dd-44a1-a2f3-6d414f99704f">
    <name>ВКМ_ДатаПроведенияРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eae9df20-8342-405b-9bcf-ecca76ef1acb">
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b604bf0a-140b-445a-ba47-6a27db168d5e">
    <name>ВКМ_ВремяОкончанияРаботПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82ee4161-4a5f-4136-924a-f437594a8cc1">
    <name>ВКМ_ОписаниеПроблемы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2779744-09b1-418c-80f6-7d33a1ebfc41">
    <name>ВКМ_Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="10ac1e4a-b982-468c-8842-593f2ee4dcb9">
    <name>ВКМ_ВыполненныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e23d67ce-a059-4b1a-b2c8-cc105a9e2689">
      <name>ВКМ_ОписаниеРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ccb5b60e-31e7-48a9-9fa9-1dd7556117bd">
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="126df77f-c7d3-40b2-833f-65c195c67af4">
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom.Расширение/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПередЗаписью")
Процедура ВКМ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
#Вставка

	
	//Проверить изменения даты, времени или специалиста
	УведомитьТБота = "";
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	Документ1.Дата,
					   |	Документ1.ВКМ_Специалист,
					   |	Документ1.ВКМ_ДатаПроведенияРабот,
					   |	Документ1.ВКМ_ВремяНачалаРаботПлан,
					   |	Документ1.ВКМ_ВремяОкончанияРаботПлан
					   |ИЗ
					   |	Документ.ВКМ_ОбслуживаниеКлиентов КАК Документ1
					   |ГДЕ
					   |	Документ1.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Если Выборка.Следующий() Тогда
			Если ВКМ_Специалист <> Выборка.ВКМ_Специалист Тогда
				ИзменСпец = СтрШаблон("Изменен специалист %1 на %2.", Строка(Выборка.ВКМ_Специалист), Строка(
					ВКМ_Специалист));
			Иначе
				ИзменСпец = "";
			КонецЕсли;
			Если ВКМ_ДатаПроведенияРабот <> Выборка.ВКМ_ДатаПроведенияРабот Тогда
				ИзменДт = СтрШаблон("Изменена дата работ %1 на %2.", формат(Выборка.ВКМ_ДатаПроведенияРабот,
					"ДФ=dd.MM.yy;"), формат(ВКМ_ДатаПроведенияРабот, "ДФ=dd.MM.yy;"));
			Иначе
				ИзменДт = "";
			КонецЕсли;

			Если ВКМ_ВремяНачалаРаботПлан <> Выборка.ВКМ_ВремяНачалаРаботПлан Тогда
				ИзменВр = СтрШаблон("Изменено время работ  %1 на %2.", формат(Выборка.ВКМ_ВремяНачалаРаботПлан,
					"ДФ=ЧЧ:мм;"), формат(ВКМ_ВремяНачалаРаботПлан, "ДФ=ЧЧ:мм;"));
			Иначе
				ИзменВр = "";
			КонецЕсли;

			Если ЗначениеЗаполнено(ИзменСпец) Или ЗначениеЗаполнено(ИзменДт) Или ЗначениеЗаполнено(ИзменВр) Тогда
				УведомитьТБота = СтрШаблон("Изменена работа у клиента %1. %2 %3 %4", ВКМ_Клиент, ИзменСпец, ИзменДт,
					ИзменВр);
			КонецЕсли;

		КонецЕсли;
	Иначе
		УведомитьТБота = СтрШаблон("Навая работа у клиента %1. Специалис %2, Дата %3, Время %4", ВКМ_Клиент,
			ВКМ_Специалист, ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан);
	КонецЕсли;

	Если ЗначениеЗаполнено(УведомитьТБота) Тогда
		НовУвед = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		НовУвед.ВКМ_ТекстСообщения = УведомитьТБота;
		НовУвед.Записать();
		ВКМ_ТелеграмВызовСервера.ОтправитьВгруппуТелеграм(УведомитьТБота);
	КонецЕсли;


#КонецВставки
КонецПроцедуры

#КонецОбласти
#КонецЕсли
